Soap/operation/CASH_TRANSFER/Outgoing/Samples/evaluate_Full.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <AMLYZE_OPERATION xmlns="urn:amlyze-services:EvaluateOperationService_v2r0">
            <CommunicationNumber>ComNr_0011</CommunicationNumber>
            <Requester>Kauno kredito unija</Requester>
            <RiskManagementCategory>OP_DEFAULT</RiskManagementCategory>
            <BusinessUnit>BUSINESS_UNIT_NAME</BusinessUnit>
            <SourceOfRiskLevel>EVALUATE</SourceOfRiskLevel>
            <OperationType>CASH_TRANSFER</OperationType>
            <FinancialFlowDirection>OUTGOING</FinancialFlowDirection>>
            <OperationExtId>OP20231114T12</OperationExtId>
            <OperationDateTime>2023-01-08T09:09:33+02:00</OperationDateTime>
            <Currency>GBP</Currency>
            <Amount>998</Amount>
            <AmountInEuro>1140.41</AmountInEuro>
            <EuroExchangeRate>1.14</EuroExchangeRate>
            <InitializeScreeningProcesses>
                <Process>SANCTIONS</Process>
                <Process>ADVERSE_MEDIA</Process>
                <Process>PEP</Process>
            </InitializeScreeningProcesses>
            <Description>Transfer of funds by cash payment</Description>
            <ListOperationParty>
                <OperationParty>
                    <PartyRole>DEBTOR</PartyRole>
                    <AccountNumber>IND20231113T180927</AccountNumber>
                    <EntityType>INDIVIDUAL</EntityType>
                    <FirstName>Geli</FirstName>
                    <LastName>Deliono</LastName>
                </OperationParty>
                <OperationParty>
                    <PartyRole>CREDITOR</PartyRole>
                    <AccountNumber>LV6630800200000018155</AccountNumber>
                    <BIC>UANFLT21XXX</BIC>
                    <Currency>GBP</Currency>
                    <BankTitle>TBC bank</BankTitle>
                    <EntityType>INDIVIDUAL</EntityType>
                    <FirstName>Geli</FirstName>
                    <LastName>Deliono</LastName>
                </OperationParty>
            </ListOperationParty>
        </AMLYZE_OPERATION>
    </soap:Body>
</soap:Envelope>